# St7GetBeamSpringAspect

Returns the aspect ratio displayed for spring elements.

long St7GetBeamSpringAspect(long uID, long* Aspect)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Aspect

The spring element aspect ratio in the range kMinSpringAspect to kMaxSpringAspect.